Repository: PrintMakerLab/mks-wifi-plugin
Catalog: i18n/*/mksplugin.po
Languages: de_de, es_es, it_it, ru_ru

# @action
source: MKS WiFi Connection
ru_ru: Подключение MKS WiFi

# @info:status Don't translate the XML tags <message>!
source: <message>{0}</message> printer connected successfully!
de_de: <message>{0}</message> Drucker erfolgreich verbunden!
es_es: <message>{0}</message> impresora conectada con éxito!
it_it: <message>{0}</message> stampante collegata correttamente!
ru_ru: Принтер <message>{0}</message> успешно подключен!

# @action:button
source: Save as TFT file
ru_ru: Сохранить как TFT файл

# @properties:tooltip
source: Save as TFT file
ru_ru: Сохранить как TFT файл

# @title:window
source: Save to File
ru_ru: Сохранить в файл

# @info:warning
source: There are no file types available to write with!
ru_ru: Недоступно ни одно расширение!

# @title:window Don't translate the XML tag <filename>!
source: <filename>{0}</filename> already exists.
ru_ru: <filename>{0}</filename> существует.

# @label Don't translate the XML tag <filename>!
source: <filename>{0}</filename> already exists. Are you sure you want to overwrite it?
ru_ru: Файл <filename>{0}</filename> существует. Уверены, что хотите перезаписать его?

# @info:progress Don't translate the XML tags <filename>!
source: Saving to <filename>{0}</filename>
ru_ru: Сохранение в <filename>{0}</filename>

# @info:title
source: Saving
ru_ru: Сохранение

# @info:status Don't translate the XML tags <filename>!
source: Permission denied when trying to save <filename>{0}</filename>
ru_ru: Недостаточно прав для сохранения <filename>{0}</filename>

# @info:status Don't translate the XML tags <filename> or <message>!
source: Could not save to <filename>{0}</filename>: <message>{1}</message>
ru_ru: Не удалось сохранить файл как <filename>{0}</filename>: <message>{1}</message>

# @info:status Don't translate the XML tags <filename>!
source: Saved to <filename>{0}</filename>
ru_ru: Сохранить как <filename>{0}</filename>

# @info:title
source: File saved
ru_ru: Файл сохранен

# @action:button
source: Open folder
ru_ru: Открыть папку

# @info:tooltip
source: Open the folder containing the file
ru_ru: Открыть папку, содержащую файл

# @info:title
source: Warning
ru_ru: Предупреждение

# @info:status
source: Something went wrong saving to <filename>{0}</filename>: <message>{1}</message>
ru_ru: Что-то пошло не так при сохранении <filename>{0}</filename>: <message>{1}</message>

# @info:title
source: Error
ru_ru: Ошибка

# @action:button
source: Print over TFT
de_de: Drucke über TFT
es_es: Impresión sobre TFT
it_it: Stampa su TFT
ru_ru: Печать через TFT

# @properties:tooltip
source: Print over TFT
de_de: Drucke über TFT
es_es: Impresión sobre TFT
it_it: Stampa su TFT
ru_ru: Печать через TFT

# @info:status Don't translate the XML tags <message>!
source: Connected to TFT on <message>{0}</message>
de_de: Über TFT verbunden mit <message>{0}</message>
es_es: Conectado a TFT en <message>{0}</message>
it_it: Collegato a TFT su <message>{0}</message>
ru_ru: Подключиться к TFT на <message>{0}</message>

# @action:button Don't translate the XML tags <message>!
source: Print over <message>{0}</message>
de_de: Drucke über <message>{0}</message>
es_es: Imprimir en <message>{0}</message>
it_it: Stampa sopra <message>{0}</message>
ru_ru: Печать на <message>{0}</message>

# @properties:tooltip Don't translate the XML tags <message>!
source: Print over <message>{0}</message>
de_de: Drucke über <message>{0}</message>
es_es: Imprimir en <message>{0}</message>
it_it: Stampa sopra <message>{0}</message>
ru_ru: Печать на <message>{0}</message>

# @info:status
source: Error: command can not send
ru_ru: Ошибка: Не удалось отправить команду

# @info:status
source: Error: Another file is uploading, please try later.
de_de: Fehler: es wird gerade eine andere Datei hochgeladen, bitte später versuchen.
es_es: Error: Otro archivo está subiendo; inténtelo más tarde.
it_it: Errore: è in corso il caricamento di un altro file, riprova più tardi.
ru_ru: Ошибка: Сейчас загружается другой файл, пожалуйста попробуйте позднее.

# @info:status Don't translate the XML tags <message>!
source: <message>{0}</message> already exists.
ru_ru: Принтер <message>{0}</message> успешно подключен.

# @action:button
source: Yes
de_de: Ja
es_es: Sí
it_it: Si
ru_ru: Да

# @action:button
source: No
de_de: Nein
ru_ru: Нет

# @info:status Don't translate the XML tags <message>!
source: <message>{0}</message> already exists, please rename it.
ru_ru: Файл <message>{0}</message> существует, пожалуйста переименуйте его.

# @info:status
source: File name is too long to upload.
de_de: Dateiname ist für das Hochladen zu lang.
es_es: El nombre del archivo es demasiado largo para cargarlo.
it_it: Il nome del file è troppo lungo per essere caricato.
ru_ru: Имя файла слишком длинное для загрузки.

# @info:status
source: File name is too long to upload, please rename it.
de_de: Dateiname ist für das Hochladen zu lang, bitte umbenennen/kürzen.
es_es: El nombre del archivo es demasiado largo para cargarlo; por favor, cámbiele el nombre.
it_it: Il nome del file è troppo lungo per essere caricato, per favore rinominalo.
ru_ru: Имя файла слишком длинное для загрузки, пожалуйста переименуйте его.

# @info:status
source: File name can not include chinese.
de_de: Dateiname kann keine chinesische Zeichen aufnehmen.
es_es: El nombre del archivo no puede incluir el chino.
it_it: Il nome del file non può includere il cinese.
ru_ru: Имя файла не может содержать китайский.

# @info:status
source: File name can not include chinese, please rename it.
de_de: Dateiname kann keine chinesische Zeichen aufnehmen, bitte umbenennen.
es_es: El nombre del archivo no puede incluir el chino; por favor, cámbiele el nombre.
it_it: Il nome del file non può includere il cinese, per favore rinominalo.
ru_ru: Имя файла не может содержать китайский, пожалуйста переименуйте его.

# @info:status
source: File cannot be transferred during printing.
de_de: Datei kann während des Druckens nicht gesendet werden.
es_es: El archivo no puede ser transferido durante la impresión.
it_it: Il file non può essere trasferito durante la stampa.
ru_ru: Файл не может быть передан во время печати.

# @info:status
source: Uploading print job to printer
de_de: Lade den Druckauftrag zum Drucker hoch
es_es: Subiendo trabajo de impresión a la impresora
it_it: Caricamento file di stampa alla stampante
ru_ru: Загрузка задания на принтер

# @info:status
source: Sending Print Job
ru_ru: Отправка задания на печать

# @info:status
source: Print Job
ru_ru: Начать печать после загрузки

# @action:button
source: Cancel
de_de: Abbrechen
es_es: Cancelar
ru_ru: Отменить

# @info:status
source: Send file to printer failed.
ru_ru: Отправка файла на принтер завершилась неудачей.

# @warning:status
source: Please prepare G-code before exporting.
de_de: Bitte bereite den G-Code vor, bevor er exportiert wird.
es_es: Por favor, prepare el código G antes de exportar.
it_it: Si prega di preparare il G-code prima di esportare.
ru_ru: Пожалуйста, подготовьте G-code перед отправкой.

# @info:status
source: Now is printing. Send file to printer failed.
de_de: Es wird gerade gedruckt. Dateiübertragung an den Drucker fehlgeschlagen.
es_es: Ahora se está imprimiendo. Falló el envío a la impresora.
it_it: Adesso sta stampando. Invio file alla stampante non riuscito.
ru_ru: Идет печать. Отправка файла на принтер завершилась неудачей.

# @info:status
source: Sending file to printer
de_de: Datei wird zum Drucker gesendet
es_es: Enviando trabajo de impresión a la impresora
it_it: Invio file alla stampante
ru_ru: Отправка файла на принтер

# @info:title
source: Sending Print Job
de_de: Sende den Druckauftrag
es_es: Enviando trabajo de impresión
it_it: Invio Stampa
ru_ru: Отправка задания на печать

# @label
source: Print job
de_de: Druckauftrag
es_es: Trabajo de impresión
it_it: Lavoro di stampa
ru_ru: Начать печать после загрузки

# @info:status
source: Print job was successfully sent to the printer.
de_de: Der Druckauftrag wurde erfolgreich zum Drucker gesendet.
es_es: El trabajo de impresión fue enviado con éxito a la impresora
it_it: Il lavoro di stampa è stato inviato con successo alla stampante.
ru_ru: Задание было успешно отправлено на принтер.

# @info:status
source: TFT Connect succeed
de_de: TFT-Verbindung erfolgreich
es_es: Conectado a TFT con éxito
it_it: TFT connesso
ru_ru: Соединение с TFT успешно

# @action:button
source: Fan On
de_de: Lüfter an
es_es: Ventilador encendido
ru_ru: Включить обдув

# @tooltip
source: Turn fan on.
de_de: Schalte Lüfter an.
es_es: Poner en marcha el ventilador
it_it: Accendi la ventola.
ru_ru: Включить вентилятор обдува.

# @action:button
source: Fan Off
de_de: Lüfter aus
es_es: Ventilador apagado
ru_ru: Выключить обдув

# @tooltip
source: Turn fan off.
de_de: Schalte Lüfter aus
es_es: Parar el ventilador
it_it: Spegni la ventola.
ru_ru: Выключить вентилятор обдува.

# @action:button
source: Unlock Motors
de_de: Motoren freigeben
es_es: Desbloquear motores
it_it: Sblocca i motori
ru_ru: Разблокировать моторы

# @tooltip
source: Unlock 3D printer motors.
de_de: 3D-Drucker-Motoren freigeben
es_es: Desbloquea los motores de la impresora 3D
it_it: Sblocca i motori della stampante 3D.
ru_ru: Разблокировать моторы 3D принтера.

# @action:button
source: Cool Down
de_de: Abkühlen
es_es: Enfriar
it_it: Raffredda
ru_ru: Охладить

# @tooltip
source: Cool down heated bed and exptuder.
de_de: Aufgeheiztes Druckbett und Düse abkühlen
es_es: Enfriar la plataforma caliente y el extrusor
it_it: Raffreddare il piatto e hot-end.
ru_ru: Отключить нагрев стола и экструдера.

# @action:button
source: Pause
ru_ru: Остановить

# @action:button
source: Resume
ru_ru: Продолжить

# @tooltip
source: Pause print.
ru_ru: Приостановить печать.

# @tooltip
source: Resume print.
ru_ru: Продолжить печать.

# @action:button
source: Abort Print
ru_ru: Прервать печать

# @tooltip
source: Abort current print.
ru_ru: Прервать текущую печать.

# @action:button
source: SD Files
de_de: SD Dateien
es_es: Archivos en SD
it_it: File su SD
ru_ru: Файлы SD

# @tooltip
source: Browse SD card in 3D printer.
de_de: SD Karteninhalt im 3D-Drucker auflisten
es_es: Explorar tarjeta SD en la impresora 3D
it_it: Sfoglia la scheda SD nella stampante 3D.
ru_ru: Обзор SD-карты в вашем принтере.

# @action:button
source: Send Print Job
de_de: Sende Druckauftrag
es_es: Enviar trabajo de impresión
it_it: Invia stampa
ru_ru: Отправить на печать

# @tooltip
source: Select and send G-Code file to 3D printer.
de_de: Wähle und sende die G-Code-Datei zum 3D-Drucker.
es_es: Seleccionar y enviar archivo en código G a la impresora 3D.
it_it: Seleziona e invia il file G-Code alla stampante 3D.
ru_ru: Выбрать и отправить файл G-Code на #D принтер.

# @title:window
source: Open file(s)
de_de: Öffne Datei(en)
es_es: Abrir archivo(s)
it_it: Apri file
ru_ru: Открыть файл(ы)

# @action:button
source: Delete
de_de: Lösche
es_es: Borrar
it_it: Elimina
ru_ru: Удалить

# @action:button
source: Print
de_de: Drucke
es_es: Imprimir
it_it: Stampa
ru_ru: Печать

# @action:button
source: Refresh
ru_ru: Обновить

# @title:window
source: Connect to Networked Printer
ru_ru: Соединение с сетевым принтером

# @label
source: To print directly to your printer from Cura, please make sure your printer is connected to the same WiFi network as this computer. If you don't connect your printer with Cura, you can still use SD drive to transfer g-code files to your printer. Select your printer from the list below:
ru_ru: Для печати на принтере из Cura убедитесь, что принтер подключен к той же сети WiFi что и этот компьютер. Если вы не подключите ваш принтер к Cura, вы все еще сможете использовать SD-накопитель для переноса g-code файлов на принтер. Выберите ваш принтер из списка ниже:

# @action:button
source: Add
de_de: Hinzufügen
es_es: Añadir
it_it: Aggiungi
ru_ru: Добавить

# @action:button
source: Edit
de_de: Ändern
es_es: Editar
it_it: Modifica
ru_ru: Править

# @action:button
source: Remove
de_de: Entfernen
es_es: Quitar
it_it: Elimina
ru_ru: Удалить

# @label
source: If your printer is not listed, read the <a href='%1'>network printing troubleshooting guide</a>
ru_ru: Если вашего принтера нет в списке, прочтите <a href='%1'>руководство по решению проблем с сетевой печатью</a>

# @label
source: Type
ru_ru: Тип

# @label
source: Firmware version
ru_ru: Версия прошивки

# @label
source: Address
ru_ru: Адрес

# @label
source: This printer is not set up to host a group of Ultimaker 3 printers.
ru_ru: Принтер не настроен быть хостом группы принтеров Ultimaker 3.

# @label
source: This printer is the host for a group of %1 Ultimaker 3 printers.
ru_ru: Принтер является хостом группы %1 принтеров Ultimaker 3.

# @label
source: The printer at this address has not yet responded.
ru_ru: Принтер с этим адресом пока не отвечает.

# @action:button
source: Connect
de_de: Verbinden
es_es: Conectar
it_it: Connetti
ru_ru: Подключить

# @action:button
source: Disconnect
de_de: Unterbrechen
es_es: Desconectar
it_it: Disconetti
ru_ru: Отключить

# @title:window
source: Adding a new printer
de_de: Neuen Drucker hinzufügen
es_es: Añadir una nueva impresora
it_it: Aggiungi una nuova stampante
ru_ru: Добавление нового принтера

# @alabel
source: Enter the IP address or hostname of your printer on the network.
de_de: Geben Sie die IP-Adresse oder Hostname Ihres Druckers ein
es_es: Escriba la dirección IP o nombre de su impresora en la red
it_it: Immettere l'indirizzo IP o l'hostname della stampante in rete.
ru_ru: Введите IP-адрес или имя хоста вашего принтера.

# @action:button
source: OK
es_es: Vale
ru_ru: Ок

# @action:button
source: Request Access
de_de: Zugriff anfragen
es_es: Petición de acceso
it_it: Richiesta di accesso
ru_ru: Запросить доступ

# @info:tooltip
source: Send access request to the printer
de_de: Sende eine Zugriffsanfrage an den Drucker
es_es: Enviar petición de acceso a la impresora
it_it: Invia richiesta di accesso alla stampante
ru_ru: Послать принтеру запрос доступа

# @info:tooltip
source: Connect to a printer
de_de: Verbindungsaufbau mit dem Drucker
es_es: Conectar con una impresora
it_it: Collegati a una stampante
ru_ru: Подключиться к принтеру

# @action:button
source: Close
de_de: Schließen
es_es: Cerrar
it_it: Chiudi
ru_ru: Закрыть

# @info:status Don't translate the XML tags <filename>!
source: <filename>{0}</filename> already exists.
de_de: <filename>{0}</filename> existiert schon.
es_es: <filename>{0}</filename> ya existe.
it_it: <filename>{0}</filename> esiste già.

# @info:status Don't translate the XML tags <filename>!
source: <filename>{0}</filename> already exists, please rename it.
de_de: <filename>{0}</filename> existiert schon, bitte umbenennen.
es_es: <filename>{0}</filename> ya existe; por favor cambie el nombre.
it_it: <filename>{0}</filename> esiste già, per favore rinominalo.

# @info:title
source: Choose file
de_de: Wähle eine Datei
es_es: Escoja un archivo

# @label
source: G-code
es_es: código G

# @label
source: All
de_de: Alles
es_es: Todo

# @info:status Don't translate the XML tags <message>!
source: <message>{0}</message> printer disconnected!
de_de: <message>{0}</message> Drucker nicht verbunden!
es_es: <message>{0}</message> impresora desconectada!

# @label
source: Custom
de_de: benutzerdefiniert
es_es: Personalizado
it_it: Personalizzata

# @title:tab
source: Network settings
de_de: Netzwerkeinstellungen
es_es: Ajustes de la red

# @title:tab
source: Preview settings
de_de: Einstellungen der Vorschau
es_es: Previsualizar ajustes

# @title:tab
source: Advanced settings
es_es: Ajustes avanzados

# @label
source: WiFi support
de_de: WLAN Unterstützung
es_es: Soporte WiFi

# @label
source: Screenshot support
de_de: Bildschirmfoto aktivieren
es_es: Capacidad de copia de pantalla
it_it: Supporto per immagini

# @label
source: Printer model
de_de: Druckermodell
es_es: Modelo de impresora

# @label
source: Maximum file name length (0..255, 30 by default)
de_de: Maximale Länge des Dateinames (0..255, 30 ist voreingestellt)
es_es: Longitud máxima del nombre de archivo (0..255, 30 por defecto)

# @label
source: Auto file renaming (if name is too long or already exists)
de_de: Automatisches Umbenennen und Kürzen des Dateinamens (wenn der Dateiname zu lang ist oder schon existiert)
es_es: Renombrar automáticamente archivos (si el nombre es muy largo o ya existe)

# @label
source: Start printing after file upload
es_es: Empezar a imprimir tras la subida

# @label
source: Switch to Monitor Tab after file upload
es_es: Pasar a la pestaña de Seguimiento después de la subida del archivo

# @label
source: MKS WiFi Plugin is active for this printer
de_de: MKS WLAN Modul aktivieren:
es_es: MKS WiFi Plugin está activo en esta impresora

# @label
source: Resume
de_de: Weitermachen
es_es: Reanudar

# @label
source: Pause
de_de: Pausieren
es_es: Paudar

# @label
source: Abort Print
de_de: Druck abbrechen
es_es: Interrumpir la impresión

# @action:button
source: More
de_de: Mehr
es_es: Más
it_it: Altro

# @title:window
source: More
de_de: Mehr
es_es: Más
it_it: Altro

# @action
source: MKS WiFi Plugin
de_de: MKS WLAN Modul
